src/test/resource/Request_XML/1.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://schema.walgreens.com/icp/pharm/pharmsigservices/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:PharmSIGServiceWrapperRequest>
         <OriginalParsedSIGToken>
            <MiscNotes>937ea49031ff416bb7725070aaf343d7</MiscNotes>
         </OriginalParsedSIGToken>
         <TransmittedSIG>1 tab(s) once a week</TransmittedSIG>
         <DrugType>
            <DosageFormCd>1</DosageFormCd>
            <DosageFormType>suresh</DosageFormType>
            <DrugDefaultSig>28</DrugDefaultSig>
	            <DrugStrength>chennai</DrugStrength>
            <DrugStrengthUOM>9790880305</DrugStrengthUOM>
            <GPI>software</GPI>
            <NDC>45000</NDC>
            <RouteOfAdminCodedVal>ramakrishnan</RouteOfAdminCodedVal>
            <SingleActiveIngredientInd>sumathi</SingleActiveIngredientInd>
            <DrugClassType>photography</DrugClassType>
         </DrugType>
         <PatientType>
            <Age>68</Age>
            <FirstName>PATIENT</FirstName>
         </PatientType>
      </v1:PharmSIGServiceWrapperRequest>
   </soapenv:Body>
</soapenv:Envelope>
